FKDD_COPY_DIFF_3_2026-02-13/ChartsOfCharacteristicTypes/ТипыСделок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>ТипыСделок</Name>
			<Comment>Типизатор измерения Сделка регистра взаиморасчетов. Описывает допустимые виды документов - сделок</Comment>
			<Type>
				<v8:Type>cfg:DocumentRef.ВозвратПоставщику</v8:Type>
				<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
				<v8:Type>cfg:DocumentRef.АктПриемаПередачиЦенныхБумаг</v8:Type>
				<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходДС</v8:Type>
				<v8:Type>cfg:DocumentRef.ВыплатаЗарплаты</v8:Type>
				<v8:Type>cfg:DocumentRef.Взаимозачет</v8:Type>
				<v8:Type>cfg:DocumentRef.ВозвратПоставщикуАвтомобилей</v8:Type>
				<v8:Type>cfg:DocumentRef.БТ_ПредоплаченноеТО</v8:Type>
				<v8:Type>cfg:DocumentRef.РеализацияАктивов</v8:Type>
				<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
				<v8:Type>cfg:DocumentRef.РеализацияАвтомобилей</v8:Type>
				<v8:Type>cfg:DocumentRef.ВводОстатковАвтомобилей</v8:Type>
				<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
				<v8:Type>cfg:DocumentRef.ЗаказВнутренний</v8:Type>
				<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
				<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
				<v8:Type>cfg:DocumentRef.РабочийЛистОтделаСтрахования</v8:Type>
				<v8:Type>cfg:DocumentRef.ЗаказПоставщикуНаАвтомобиль</v8:Type>
				<v8:Type>cfg:DocumentRef.ПоступлениеАвтомобилей</v8:Type>
				<v8:Type>cfg:DocumentRef.ВводОстатковТоваров</v8:Type>
				<v8:Type>cfg:DocumentRef.ТаможеннаяДекларацияИмпорт</v8:Type>
				<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
				<v8:Type>cfg:DocumentRef.ВводОстатковВзаиморасчетов</v8:Type>
				<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
				<v8:Type>cfg:DocumentRef.НачислениеЗарплаты</v8:Type>
				<v8:Type>cfg:DocumentRef.СчетОтПоставщика</v8:Type>
				<v8:Type>cfg:DocumentRef.СтраховойПолис</v8:Type>
				<v8:Type>cfg:DocumentRef.ВозвратОтПокупателяАвтомобилей</v8:Type>
				<v8:Type>cfg:DocumentRef.ОбслуживаниеАктива</v8:Type>
				<v8:Type>cfg:DocumentRef.ВозвратОтПокупателя</v8:Type>
				<v8:Type>cfg:DocumentRef.ОтчетКомиссионераЗаАвтомобили</v8:Type>
				<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
				<v8:Type>cfg:DocumentRef.ОтчетКомитенту</v8:Type>
				<v8:Type>cfg:DocumentRef.ЧекНаОплату</v8:Type>
				<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
				<v8:Type>cfg:DocumentRef.ИнвентаризацияАвтомобилей</v8:Type>
				<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
				<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
				<v8:Type>cfg:DocumentRef.ПланПоступленияДС</v8:Type>
				<v8:Type>cfg:DocumentRef.Выписка</v8:Type>
				<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
				<v8:Type>cfg:DocumentRef.ЗаказНаАвтомобиль</v8:Type>
				<v8:Type>cfg:DocumentRef.АктРазногласий</v8:Type>
				<v8:Type>cfg:DocumentRef.СчетНаОплатуЗаАвтомобили</v8:Type>
				<v8:Type>cfg:DocumentRef.Инкассация</v8:Type>
				<v8:Type>cfg:DocumentRef.СчетОтПоставщикаЗаАвтомобили</v8:Type>
				<v8:Type>cfg:DocumentRef.ПереоценкаВалютныхСредств</v8:Type>
				<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
				<v8:Type>cfg:DocumentRef.ОтчетКомитентуЗаАвтомобили</v8:Type>
			</Type>
			<Hierarchical>false</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗапретитьПереплатуПоСделкам</Name>
					<Comment>Если флажок установлен, то в документе данного типа запрещено превышать сумму сделки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дебетовый</Name>
					<Comment>Дебетовый</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кредитовый</Name>
					<Comment>Кредитовый</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/ChartsOfCharacteristicTypes/ТипыСделок/Ext/ManagerModule.bsl
//заполняет предопределённые элементы справочника
//
// Параметры
//	ЗаполнятьВсе - Булево
//
Процедура ЗаполнитьПредопределенныеЭлементы(ЗаполнятьВсе = Ложь) Экспорт
	Макет = ПланыВидовХарактеристик.ТипыСделок.ПолучитьМакет("НастройкиПоУмолчанию");
	Если Макет = Неопределено Тогда
		Сообщить("Не обнаружен макет начальных настроек!");
		Возврат;
	КонецЕсли;
	Для НомерСтроки = 1 По Макет.ВысотаТаблицы Цикл
		// Считаем из макета Имя, Наименование, Код, ЗапретитьПереплатуПоСделкам, Дебетовый, Кредитовый
		СтрИмя = СокрЛП(Макет.Область(НомерСтроки,1).Текст);
		СтрНаименование = СокрЛП(Макет.Область(НомерСтроки,2).Текст);
		СтрКод = СокрЛП(Макет.Область(НомерСтроки,3).Текст);
		СтрЗапретитьПереплатуПоСделкам = СокрЛП(Макет.Область(НомерСтроки,5).Текст);
		СтрДебетовый =	СокрЛП(Макет.Область(НомерСтроки,6).Текст);
		СтрКредитовый =	СокрЛП(Макет.Область(НомерСтроки,7).Текст);
		СсылкаТипСделки = ПланыВидовХарактеристик.ТипыСделок[СтрИмя];
		Если СсылкаТипСделки.Пустая() Тогда
			Сообщить("Ошибка при заполнении типа сделки: '" + СтрНаименование + "'. Указан отсутствующий элемент ПВХ Типы сделок!");
			Продолжить;
		Иначе
			ОбъектТипСделки = СсылкаТипСделки.ПолучитьОбъект();
		КонецЕсли;
		//заполняем реквизиты
		Если ЗаполнятьВсе Тогда
			ОбъектТипСделки.Наименование = СтрНаименование;
		ИначеЕсли обЗначениеНеЗаполнено(ОбъектТипСделки.Наименование) Тогда
			ОбъектТипСделки.Наименование = СтрНаименование;
		КонецЕсли;
		ЗапретитьПереплатуПоСделкам = ?(СтрЗапретитьПереплатуПоСделкам = "Истина",Истина,Ложь);
		Если ОбъектТипСделки.ЗапретитьПереплатуПоСделкам<>ЗапретитьПереплатуПоСделкам Тогда
			ОбъектТипСделки.ЗапретитьПереплатуПоСделкам = ЗапретитьПереплатуПоСделкам;
		КонецЕсли;
		Дебетовый = ?(СтрДебетовый = "Истина",Истина,Ложь);
		Если ОбъектТипСделки.Дебетовый <>Дебетовый Тогда
			ОбъектТипСделки.Дебетовый = Дебетовый;
		КонецЕсли;
		Кредитовый = ?(СтрКредитовый = "Истина",Истина,Ложь);
		Если ОбъектТипСделки.Кредитовый <>Кредитовый Тогда
			ОбъектТипСделки.Кредитовый = Кредитовый;
		КонецЕсли;
		//если что-то изменили, то записываем
		Если ОбъектТипСделки.Модифицированность() Тогда
			Попытка		
				ОбъектТипСделки.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры // ЗаполнитьПредопределенныеЭлементы()
